ipeerbhai/FollowMe/PSoC/pwmUartFirmware/pwmUartFirmware.cydsn/Generated_Source/PSoC4/TIMER_ThreadTimer.c
        /* Exit Critical Region*/
        CyExitCriticalSection(TIMER_ThreadTimer_interruptState);

        #if (TIMER_ThreadTimer_EnableTriggerMode)
            TIMER_ThreadTimer_EnableTrigger();
        #endif /* Set Trigger enable bit for UDB implementation in the control register*/

        #if (TIMER_ThreadTimer_InterruptOnCaptureCount)
             #if (!TIMER_ThreadTimer_ControlRegRemoved)
                TIMER_ThreadTimer_SetInterruptCount(TIMER_ThreadTimer_INIT_INT_CAPTURE_COUNT);
            #endif /* Set interrupt count in control register if control register is not removed */
        #endif /*Set interrupt count in UDB implementation if interrupt count feature is checked.*/

        TIMER_ThreadTimer_ClearFIFO();
    #endif /* Configure additional features of UDB implementation */

    TIMER_ThreadTimer_SetInterruptMode(TIMER_ThreadTimer_INIT_INTERRUPT_MODE);
}


/*******************************************************************************
* Function Name: TIMER_ThreadTimer_Enable
********************************************************************************
*
* Summary:
*  Enable the Timer
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_ThreadTimer_Enable(void) 
{
    /* Globally Enable the Fixed Function Block chosen */
    #if (TIMER_ThreadTimer_UsingFixedFunction)
        TIMER_ThreadTimer_GLOBAL_ENABLE |= TIMER_ThreadTimer_BLOCK_EN_MASK;
        TIMER_ThreadTimer_GLOBAL_STBY_ENABLE |= TIMER_ThreadTimer_BLOCK_STBY_EN_MASK;
    #endif /* Set Enable bit for enabling Fixed function timer*/

    /* Remove assignment if control register is removed */
    #if (!TIMER_ThreadTimer_ControlRegRemoved || TIMER_ThreadTimer_UsingFixedFunction)
        TIMER_ThreadTimer_CONTROL |= TIMER_ThreadTimer_CTRL_ENABLE;
    #endif /* Remove assignment if control register is removed */
}


/*******************************************************************************
* Function Name: TIMER_ThreadTimer_Start
********************************************************************************
*
* Summary:
*  The start function initializes the timer with the default values, the
*  enables the timerto begin counting.  It does not enable interrupts,
*  the EnableInt command should be called if interrupt generation is required.
*
* Parameters:
*  void
*
* Return:
*  void
*
* Global variables:
*  TIMER_ThreadTimer_initVar: Is modified when this function is called for the
*   first time. Is used to ensure that initialization happens only once.
*
*******************************************************************************/
void TIMER_ThreadTimer_Start(void) 
{
    if(TIMER_ThreadTimer_initVar == 0u)
    {
        TIMER_ThreadTimer_Init();

        TIMER_ThreadTimer_initVar = 1u;   /* Clear this bit for Initialization */
    }

    /* Enable the Timer */
    TIMER_ThreadTimer_Enable();
}


/*******************************************************************************
* Function Name: TIMER_ThreadTimer_Stop
********************************************************************************
*
* Summary:
*  The stop function halts the timer, but does not change any modes or disable
*  interrupts.
*
* Parameters:
*  void
*
* Return:
*  void
*
* Side Effects: If the Enable mode is set to Hardware only then this function
*               has no effect on the operation of the timer.
*
*******************************************************************************/
void TIMER_ThreadTimer_Stop(void) 
{
    /* Disable Timer */
    #if(!TIMER_ThreadTimer_ControlRegRemoved || TIMER_ThreadTimer_UsingFixedFunction)
        TIMER_ThreadTimer_CONTROL &= ((uint8)(~TIMER_ThreadTimer_CTRL_ENABLE));
    #endif /* Remove assignment if control register is removed */

    /* Globally disable the Fixed Function Block chosen */
    #if (TIMER_ThreadTimer_UsingFixedFunction)
        TIMER_ThreadTimer_GLOBAL_ENABLE &= ((uint8)(~TIMER_ThreadTimer_BLOCK_EN_MASK));
        TIMER_ThreadTimer_GLOBAL_STBY_ENABLE &= ((uint8)(~TIMER_ThreadTimer_BLOCK_STBY_EN_MASK));
    #endif /* Disable global enable for the Timer Fixed function block to stop the Timer*/
}


/*******************************************************************************
* Function Name: TIMER_ThreadTimer_SetInterruptMode
********************************************************************************
*
* Summary:
*  This function selects which of the interrupt inputs may cause an interrupt.
*  The twosources are caputure and terminal.  One, both or neither may
*  be selected.
*
* Parameters:
*  interruptMode:   This parameter is used to enable interrups on either/or
*                   terminal count or capture.
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_ThreadTimer_SetInterruptMode(uint8 interruptMode) 
{
    TIMER_ThreadTimer_STATUS_MASK = interruptMode;
}


/*******************************************************************************
* Function Name: TIMER_ThreadTimer_SoftwareCapture
********************************************************************************
*
* Summary:
*  This function forces a capture independent of the capture signal.
*
* Parameters:
*  void
*
* Return:
*  void
*
* Side Effects:
*  An existing hardware capture could be overwritten.
*
*******************************************************************************/
void TIMER_ThreadTimer_SoftwareCapture(void) 
{
    /* Generate a software capture by reading the counter register */
    (void)TIMER_ThreadTimer_COUNTER_LSB;
    /* Capture Data is now in the FIFO */
}


/*******************************************************************************
* Function Name: TIMER_ThreadTimer_ReadStatusRegister
********************************************************************************
*
* Summary:
*  Reads the status register and returns it's state. This function should use
*  defined types for the bit-field information as the bits in this register may
*  be permuteable.
*
* Parameters:
*  void
*
* Return:
*  The contents of the status register
*
* Side Effects:
*  Status register bits may be clear on read.
*
*******************************************************************************/
uint8   TIMER_ThreadTimer_ReadStatusRegister(void) 
{
    return (TIMER_ThreadTimer_STATUS);
}


#if (!TIMER_ThreadTimer_ControlRegRemoved) /* Remove API if control register is removed */


