ipeerbhai/FollowMe/PSoC/pwmUartFirmware/pwmUartFirmware.cydsn/Generated_Source/PSoC4/TIMER_ThreadTimer.c
#if (TIMER_ThreadTimer_SoftwareCaptureMode)


/*******************************************************************************
* Function Name: TIMER_ThreadTimer_SetCaptureMode
********************************************************************************
*
* Summary:
*  This function sets the capture mode to either rising or falling edge.
*
* Parameters:
*  captureMode: This parameter sets the capture mode of the UDB capture feature
*  The parameter values are defined using the
*  #define TIMER_ThreadTimer__B_TIMER__CM_NONE 0
#define TIMER_ThreadTimer__B_TIMER__CM_RISINGEDGE 1
#define TIMER_ThreadTimer__B_TIMER__CM_FALLINGEDGE 2
#define TIMER_ThreadTimer__B_TIMER__CM_EITHEREDGE 3
#define TIMER_ThreadTimer__B_TIMER__CM_SOFTWARE 4
 identifiers
*  The following are the possible values of the parameter
*  TIMER_ThreadTimer__B_TIMER__CM_NONE        - Set Capture mode to None
*  TIMER_ThreadTimer__B_TIMER__CM_RISINGEDGE  - Rising edge of Capture input
*  TIMER_ThreadTimer__B_TIMER__CM_FALLINGEDGE - Falling edge of Capture input
*  TIMER_ThreadTimer__B_TIMER__CM_EITHEREDGE  - Either edge of Capture input
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_ThreadTimer_SetCaptureMode(uint8 captureMode) 
{
    /* This must only set to two bits of the control register associated */
    captureMode = ((uint8)((uint8)captureMode << TIMER_ThreadTimer_CTRL_CAP_MODE_SHIFT));
    captureMode &= (TIMER_ThreadTimer_CTRL_CAP_MODE_MASK);

    /* Clear the Current Setting */
    TIMER_ThreadTimer_CONTROL &= ((uint8)(~TIMER_ThreadTimer_CTRL_CAP_MODE_MASK));

    /* Write The New Setting */
    TIMER_ThreadTimer_CONTROL |= captureMode;
}
#endif /* Remove API if Capture Mode is not Software Controlled */


#if (TIMER_ThreadTimer_SoftwareTriggerMode)


/*******************************************************************************
* Function Name: TIMER_ThreadTimer_SetTriggerMode
********************************************************************************
*
* Summary:
*  This function sets the trigger input mode
*
* Parameters:
*  triggerMode: Pass one of the pre-defined Trigger Modes (except Software)
    #define TIMER_ThreadTimer__B_TIMER__TM_NONE 0x00u
    #define TIMER_ThreadTimer__B_TIMER__TM_RISINGEDGE 0x04u
    #define TIMER_ThreadTimer__B_TIMER__TM_FALLINGEDGE 0x08u
    #define TIMER_ThreadTimer__B_TIMER__TM_EITHEREDGE 0x0Cu
    #define TIMER_ThreadTimer__B_TIMER__TM_SOFTWARE 0x10u
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_ThreadTimer_SetTriggerMode(uint8 triggerMode) 
{
    /* This must only set to two bits of the control register associated */
    triggerMode &= TIMER_ThreadTimer_CTRL_TRIG_MODE_MASK;

    /* Clear the Current Setting */
    TIMER_ThreadTimer_CONTROL &= ((uint8)(~TIMER_ThreadTimer_CTRL_TRIG_MODE_MASK));

    /* Write The New Setting */
    TIMER_ThreadTimer_CONTROL |= (triggerMode | TIMER_ThreadTimer__B_TIMER__TM_SOFTWARE);

}
#endif /* Remove API if Trigger Mode is not Software Controlled */

#if (TIMER_ThreadTimer_EnableTriggerMode)


/*******************************************************************************
* Function Name: TIMER_ThreadTimer_EnableTrigger
********************************************************************************
*
* Summary:
*  Sets the control bit enabling Hardware Trigger mode
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_ThreadTimer_EnableTrigger(void) 
{
    #if (!TIMER_ThreadTimer_ControlRegRemoved)   /* Remove assignment if control register is removed */
        TIMER_ThreadTimer_CONTROL |= TIMER_ThreadTimer_CTRL_TRIG_EN;
    #endif /* Remove code section if control register is not used */
}


/*******************************************************************************
* Function Name: TIMER_ThreadTimer_DisableTrigger
********************************************************************************
*
* Summary:
*  Clears the control bit enabling Hardware Trigger mode
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_ThreadTimer_DisableTrigger(void) 
{
    #if (!TIMER_ThreadTimer_ControlRegRemoved)   /* Remove assignment if control register is removed */
        TIMER_ThreadTimer_CONTROL &= ((uint8)(~TIMER_ThreadTimer_CTRL_TRIG_EN));
    #endif /* Remove code section if control register is not used */
}
#endif /* Remove API is Trigger Mode is set to None */


#if(TIMER_ThreadTimer_InterruptOnCaptureCount)
#if (!TIMER_ThreadTimer_ControlRegRemoved)   /* Remove API if control register is removed */


/*******************************************************************************
* Function Name: TIMER_ThreadTimer_SetInterruptCount
********************************************************************************
*
* Summary:
*  This function sets the capture count before an interrupt is triggered.
*
* Parameters:
*  interruptCount:  A value between 0 and 3 is valid.  If the value is 0, then
*                   an interrupt will occur each time a capture occurs.
*                   A value of 1 to 3 will cause the interrupt
*                   to delay by the same number of captures.
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_ThreadTimer_SetInterruptCount(uint8 interruptCount) 
{
    /* This must only set to two bits of the control register associated */
    interruptCount &= TIMER_ThreadTimer_CTRL_INTCNT_MASK;

    /* Clear the Current Setting */
    TIMER_ThreadTimer_CONTROL &= ((uint8)(~TIMER_ThreadTimer_CTRL_INTCNT_MASK));
    /* Write The New Setting */
    TIMER_ThreadTimer_CONTROL |= interruptCount;
}
#endif /* Remove API if control register is removed */
#endif /* TIMER_ThreadTimer_InterruptOnCaptureCount */


#if (TIMER_ThreadTimer_UsingHWCaptureCounter)


/*******************************************************************************
* Function Name: TIMER_ThreadTimer_SetCaptureCount
********************************************************************************
*
* Summary:
*  This function sets the capture count
*
* Parameters:
*  captureCount: A value between 2 and 127 inclusive is valid.  A value of 1
*                to 127 will cause the interrupt to delay by the same number of
*                captures.
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_ThreadTimer_SetCaptureCount(uint8 captureCount) 
{
    TIMER_ThreadTimer_CAP_COUNT = captureCount;
}


/*******************************************************************************
* Function Name: TIMER_ThreadTimer_ReadCaptureCount
********************************************************************************
*
* Summary:
*  This function reads the capture count setting
*
* Parameters:
*  void
*
* Return:
*  Returns the Capture Count Setting
*
*******************************************************************************/
uint8 TIMER_ThreadTimer_ReadCaptureCount(void) 
{
    return ((uint8)TIMER_ThreadTimer_CAP_COUNT);
}
#endif /* TIMER_ThreadTimer_UsingHWCaptureCounter */


/*******************************************************************************
* Function Name: TIMER_ThreadTimer_ClearFIFO
********************************************************************************
*
* Summary:
*  This function clears all capture data from the capture FIFO
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_ThreadTimer_ClearFIFO(void) 
{
    while(0u != (TIMER_ThreadTimer_ReadStatusRegister() & TIMER_ThreadTimer_STATUS_FIFONEMP))
    {
        (void)TIMER_ThreadTimer_ReadCapture();
    }
}

#endif /* UDB Specific Functions */


/* [] END OF FILE */
